7.-App de resevas y compras de viajes y hoteles.- SQLServer, C#, Enty Framework/Services/MyCTS.Services/Web References/TravelItineraryAddInfoTest/TravelItineraryAddInfoLLS1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:xsd3="http://www.opentravel.org/OTA/2002/08" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:xsd1="http://webservices.sabre.com/sabreXML/2003/07" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xsd2="http://webservices.sabre.com/sabreXML/2003/07" targetNamespace="https://webservices.sabre.com/websvc" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import schemaLocation="TravelItineraryAddInfoLLS1.10.1RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2003/07" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
    </xsd:schema>
  </types>
  <message name="TravelItineraryAddInfoInput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd2:TravelItineraryAddInfoRQ" />
  </message>
  <message name="TravelItineraryAddInfoOutput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd2:TravelItineraryAddInfoRS" />
  </message>
  <portType name="TravelItineraryAddInfoPortType">
    <operation name="TravelItineraryAddInfoRQ">
      <input message="tns:TravelItineraryAddInfoInput" />
      <output message="tns:TravelItineraryAddInfoOutput" />
    </operation>
  </portType>
  <binding name="TravelItineraryAddInfoSoapBinding" type="tns:TravelItineraryAddInfoPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="TravelItineraryAddInfoRQ">
      <soap:operation soapAction="OTA" />
      <input>
        <soap:header message="tns:TravelItineraryAddInfoInput" part="header" use="literal" />
        <soap:header message="tns:TravelItineraryAddInfoInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </input>
      <output>
        <soap:header message="tns:TravelItineraryAddInfoOutput" part="header" use="literal" />
        <soap:header message="tns:TravelItineraryAddInfoOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </output>
    </operation>
  </binding>
  <service name="TravelItineraryAddInfoService">
    <port name="TravelItineraryAddInfoPortType" binding="tns:TravelItineraryAddInfoSoapBinding">
      <soap:address location="https://sws-crt.cert.sabre.com/" />
    </port>
  </service>
</definitions>