traveler_rq.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="https://webservices.sabre.com/websvc" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xlinx="http://www.w3.org/1999/xlink"><env:Header><eb:MessageHeader SOAP-ENV:mustUnderstand="1" eb:version="2.0"><eb:ConversationId>elia@mytravelershaven.com</eb:ConversationId><eb:From><eb:PartyId type="urn:x12.org:IO5:01">hotelengine.com</eb:PartyId></eb:From><eb:To><eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId></eb:To><eb:CPAId>P40G</eb:CPAId><eb:Service eb:type="sabreXML">Travel Itinerary Info</eb:Service><eb:Action>TravelItineraryAddInfoLLSRQ</eb:Action><eb:MessageData><eb:MessageId>mid:20120227-142607@hotelengine.com</eb:MessageId><eb:RefToMessageId>mid:20120227-142606@hotelengine.com</eb:RefToMessageId><eb:Timestamp>2012-02-27T14:26:07Z</eb:Timestamp></eb:MessageData></eb:MessageHeader><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext"><wsse:BinarySecurityToken xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility" wsu:Id="SabreSecurityToken" valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!-3949528136776527104!1076418!0</wsse:BinarySecurityToken></wsse:Security></env:Header><env:Body><TravelItineraryAddInfoRQ xmlns="http://webservices.sabre.com/sabreXML/2003/07" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" TimeStamp="2012-02-27T14:26:07" Version="1.10.1"><POS><Source PseudoCityCode="P40G"></Source></POS><AgencyInfo><Address><AddressLine>MyTravelersHaven.com</AddressLine><StreetNmbr>425 S. Cherry Street</StreetNmbr><CityName>DENVER</CityName><PostalCode>80246</PostalCode><StateCountyProv StateCode="CO"></StateCountyProv><CountryCode>US</CountryCode></Address><Ticketing TicketType="7T-"></Ticketing></AgencyInfo><CustomerInfo><PersonName TravelerRefNumber="1.1" NameReference="REF1"><GivenName>Giuseppe</GivenName><Surname>Ferry</Surname></PersonName><Telephone AreaCityCode="" PhoneNumber="1-562-887-0466" PhoneUseType="H" TravelerRefNumber="1.1"></Telephone></CustomerInfo></TravelItineraryAddInfoRQ></env:Body></env:Envelope>
